Revit 2027 API
DocumentSavingAsEventArgs.PathName Property
 Target path to which the document is to be saved.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PathName { get; }
Public ReadOnly Property PathName As String
	Get
public:
property String^ PathName {
	String^ get ();
}
member PathName : string with get
Property Value
String
See Also
Reference
DocumentSavingAsEventArgs Class
Autodesk.Revit.DB.Events Namespace